from my_utils import GraphData, Axis, Marks, AxisScale, Line
from numpy import array
jw2 = [413, 1340, 3087, 5910, 10065, 15808, 23395, 33082, 45125, 59780, 77303, 97950]
jw1 = [370, 963, 1832, 2977, 4398, 6095, 8068, 10317, 12842, 15643, 18720, 22073]
jwd = [527, 1550, 3346, 6133, 10103, 15478, 22457, 31244, 42070, 55093, 70602, 88710]
bk2 = [394, 1528, 2881, 6064, 9546, 13594, 17771, 25778, 34489, 43765, 53287, 64024]
bk1 = [298, 876, 1583, 2700, 4046, 5623, 7222, 9428, 11922, 14560, 17523, 20663]
bkd = [497, 1840, 3257, 7118, 10723, 15592, 18397, 29528, 38484, 48184, 57396, 70769]
jwr1 = [149, 392, 819, 1339, 2004, 2994, 3996, 5630, 6903, 9276, 11351, 14902]
jwr2 = [181, 416, 888, 1403, 2071, 3021, 4063, 5523, 6820, 8864, 10597, 13873]
jwrd = [204, 477, 882, 1350, 1980, 2811, 3750, 5097, 5885, 7876, 9318, 12194]
bkr2 = [126, 407, 804, 1406, 2269, 3109, 4413, 6111, 7957, 10523, 12695, 19096]
bkr1 = [148, 428, 784, 1458, 2110, 3079, 4194, 6062, 7234, 9845, 11714, 17083]
bkrd = [164, 498, 866, 1439, 2223, 2911, 4158, 5512, 6684, 8643, 10680, 15599]
s2xn2 = [100, 246, 456, 730, 1068, 1470, 1936, 2466, 3060, 3718, 4440, 5226]
s2xn1 = [174, 420, 772, 1230, 1794, 2464, 3240, 4122, 5110, 6204, 7404, 8710]
s2xnd = [67, 99, 131, 163, 195, 227, 259, 291, 323, 355, 387, 419]
sgen_s2 = [142, 342, 626, 994, 1446, 1982, 2602, 3306, 4094, 4966, 5922, 6962]
sgen_s1 = [240, 570, 1040, 1650, 2400, 3290, 4320, 5490, 6800, 8250, 9840, 11570]
sgen_sd = [99, 152, 205, 258, 311, 364, 417, 470, 523, 576, 629, 682]
sgen_yr2 = [136, 327, 598, 949, 1380, 1891, 2482, 3153, 3904, 4735, 5646, 6637]
sgen_yr1 = [260, 618, 1128, 1790, 2604, 3570, 4688, 5958, 7380, 8954, 10680, 12558]
sgen_yrd = [126, 192, 258, 324, 390, 456, 522, 588, 654, 720, 786, 852]
pauli_num = [60.0, 150.0, 280.0, 450.0, 660.0, 910.0, 1200.0, 1530.0, 1900.0, 2310.0, 2760.0, 3250.0]

# uccsd
pauli_num =[84, 828, 2340,4620,7668, 11484]
jw2 = [657,9028,32208,76828,149512,256884]
jw1 = [460,4453,12721,25261,42073,63157]
jwd = [853,11019,37887,88109,168307,285105]
bk2 = [591,9262,28122,67027,128200,192266]
bk1 = [299,3791,10636,22214,38251, 57336]
bkd = [742,10997,32910, 76533,145118,216968]
jwr1 = [277,3314,11209, 27912,53498,91783]
jwr2 = [231,2551,9246, 23399,46141,79600]
jwrd = [331,3510,10749, 25436,46368,76216]
bkr2 = [233,3441,11376, 27904,54506,90344]
bkr1 = [169,2779,9358,22850, 46872, 79600]
bkrd = [276,2562,11263,25596, 46100, 76941]
cycl2 = [292.0, 1860.0, 4996.0, 9828.0, 16484.0, 25092.0]
cycld = [412.0, 2166.0, 5608.0, 10962.0, 18452.0, 28302.0]

n = len(jw2)
Xs = [4*i for i in range(2, n + 2)]
jw_line = Line(Xs, Xs, Marks.triangle(), "blue", "ДВ")
bk_line = Line(Xs, Xs, Marks.triangle(), "red", "БК")
jw_opt_line = Line(Xs, Xs, Marks.square(), "blue", "ДВ опт")
bk_opt_line = Line(Xs, Xs, Marks.square(), "red", "БК опт")
cycl_line = Line(Xs, Xs, Marks.pentagon(), "green", "cycl")

swap2xn_line = Line(Xs, Xs, Marks.pentagon(), "green", "SWAP 2xn")
swapgens_line = Line(Xs, Xs, Marks.pentagon(), "black", "SWAP short")
swapgeny_line = Line(Xs, Xs, Marks.pentagon(), "gray", "SWAP yor")

if __name__ == "__main__":
    # lines=[jw_line, bk_line, jw_opt_line, bk_opt_line, swap2xn_line, swapgens_line, swapgeny_line],

    depth_arr = [jwd, bkd, jwrd, bkrd, cycld]
    double_arr = [jw2, bk2, jwr2, bkr2, cycl2]
    lines=[jw_line, bk_line, jw_opt_line, bk_opt_line, cycl_line]
    for index, line in enumerate(lines):
        line.Y = depth_arr[index]
    depth = Axis(
        lines=lines,
        xlabel= "Число кубитов",
        ylabel= "Глубина схемы",
        axistype=AxisScale.usual(),
        )
    for index, line in enumerate(lines):
        line.Y = double_arr[index]/array(pauli_num)
    cx_num = Axis(
        lines=lines,
        xlabel= "Число кубитов",
        ylabel= "Число ",
        axistype=AxisScale.usual(),
        )
    # Xs = 
    gd = GraphData([depth, cx_num])
    print(gd.generate_tikz())